Repository: ham3da/ham3da-integration-for-oxapay-in-woocommerce
Catalog: lang/ham3da-integration-for-oxapay-*-woocommerce-*.po
Languages: fa_ir

source: Pay with OxaPay
fa_ir: پرداخت با OxaPay

source: OxaPay redirects customers to OxaPay website for payment.
fa_ir: OxaPay مشتریان را برای پرداخت توسط رمزارزها به سامانه OxaPay هدایت می‌کند.

source: OxaPay Settings
fa_ir: تنظیمات OxaPay

source: Complete this form after creating an account in OxaPay.
fa_ir: پس از ایجاد حساب کاربری در OxaPay، این فرم را تکمیل کنید.

source: Create an account
fa_ir: ایجاد حساب کاربری

source: Enable/Disable
fa_ir: فعال/غیرفعال

source: Enable OxaPay payment method
fa_ir: روش پرداخت OxaPay را فعال کنید

source: Title
fa_ir: عنوان

source: This controls the title which the user sees during checkout.
fa_ir: عنوانی را که کاربر در هنگام پرداخت می بیند تعیین می‌کند.

source: Description
fa_ir: شرح

source: This controls the description which the user sees during checkout.
fa_ir: در این بخش متنی را که می‌خواهید کاربر در هنگام انتخاب این درگاه مشاهده نماید وارد نمایید.

source: Secure payment with OxaPay payment gateway
fa_ir: پرداخت امن با ارز دیجیتال

source: Order button text
fa_ir: متن دکمه پرداخت

source: Please enter your OxaPay Merchant API Key.
fa_ir: لطفا کلید OxaPay Merchant API خود را وارد کنید.

source: Debug Log
fa_ir: گزارش عیب یابی

source: Enable logging
fa_ir: فعال سازی عیب‌یابی

source: Log OxaPay events, such as payment confirmations.
fa_ir: رویدادهای OxaPay مانند تأییدیه‌های پرداخت را ثبت کنید.

source: Payment expiration
fa_ir: انقضای پرداخت

source: Select the payment expiration time.
fa_ir: زمان انقضا را برای لینک پرداخت تنظیم کنید.

source: 15 mins
fa_ir: 15 دقیقه

source: 30 mins
fa_ir: 30 دقیقه

source: 60 mins
fa_ir: 60 دقیقه

source: 90 mins
fa_ir: 90 دقیقه

source: 120 mins
fa_ir: 120 دقیقه

source: Is fee paid by user?
fa_ir: آیا کارمزد توسط کاربر پرداخت خواهد شد؟

source: In this section, you determine whether the user will pay the transaction fee.
fa_ir: در این بخش تعیین می‌کنید که آیا کاربر کارمزد تراکنش را پرداخت خواهد کرد یا نه.

source: No
fa_ir: نخیر

source: Yes
fa_ir: بله

source: Gateway logo
fa_ir: لوگوی درگاه

source: Logo URL
fa_ir: آدرس لوگو

source: Conversion Rate
fa_ir: نرخ تبدیل

source: If your WooCommerce currency is not usd, enter the conversion rate; Otherwise enter 1.
fa_ir: اگر واحد پولی ووکامرس شما USD نیست؛ نرخ تبدیل را وارد کنید؛ در غیر این صورت 1 را وارد کنید.

source: Method of calculating the conversion rate: the price of one USD to %s
fa_ir: روش محاسبه نرخ تبدیل: قیمت یک دلار آمریکا به %s

source: Show total amount in USD
fa_ir: نمایش مبلغ کل به دلار

source: Display the total amount in USD on the checkout page
fa_ir: نمایش مبلغ کل به دلار در صفحه پرداخت

source: Automatic conversion rate updates
fa_ir: به روز رسانی خودکار نرخ تبدیل

source: Automatic update of conversion rate from %s .
fa_ir: به روز رسانی خودکار نرخ تبدیل از %s .

source: Use this url to automatically update the rate in Cron jobs:
fa_ir: از این آدرس برای به روز رسانی خودکار نرخ تبدیل در کران جاب استفاده نمایید:

source: API Key
fa_ir: کلید API

source: Get it from %s
fa_ir: آن را از %s دریافت کنید

source: Unknown error
fa_ir: خطای ناشناخته

source: No HMAC signature sent.
fa_ir: امضای HMAC ارسال نشده است.

source: Payment has already been completed.[id: %s]
fa_ir: پرداخت در حال حاضر کامل شده است. [شناسه: %s]

source: Payment has already been completed.
fa_ir: پرداخت در حال حاضر تکمیل شده است. [شناسه: %s]

source: Order not found![id: %s]
fa_ir: سفارش پیدا نشد! [شناسه: %s]

source: Payment was successful!
fa_ir: تراکنش با موفقیت انجام شد!

source: Order is confirming.
fa_ir: سفارش در حال تایید است.

source: Order is failed.
fa_ir: سفارش با شکست مواجه شد.

source: Order is pending.
fa_ir: سفارش در انتظار است.

source: Awaiting Payment. payment id: %s
fa_ir: در انتظار پرداخت. شناسه پرداخت: %s

source: Error connecting to payment gateway
fa_ir: خطای اتصال به درگاه پرداخت: %s

source: An error has occurred.
fa_ir: خطایی رخ داده است.

source: An error has occurred. Contact site support.
fa_ir: خطایی رخ داده است. با پشتیبانی سایت تماس بگیرید.

source: Error connecting to the payment gateway: %s
fa_ir: خطا در اتصال به درگاه پرداخت: %s

source: The payment amount is invalid!
fa_ir: مبلغ پرداخت نامعتبر است!

source: Amount paid:
fa_ir: مبلغ پرداختی:

source: Amount to pay:
fa_ir: مبلغ پرداختی:

source: USD
fa_ir: دلار

source: Track ID:
fa_ir: شناسه تراکنش:

source: Payer address:
fa_ir: آدرس پرداخت کننده:

source: Status:
fa_ir: وضعیت:

source: CryptoCurrency payment
fa_ir: پرداخت رمز ارزی

source: Equal to
fa_ir: برابر با

source: Proceed to OxaPay
fa_ir: پرداخت با ارز دیجیتال

source: Payment via OxaPay
fa_ir: پرداخت از طریق OxaPay

source: ham3da integration for OxaPay
fa_ir: درگاه OxaPay برای ووکامرس

source: Accept cryptocurrency payments on your WooCommerce store.
fa_ir: با OxaPay، امکان پرداخت سفارش‌ها با رمزارزها برای فروشگاه ووکامرسی شما فراهم می‌شود.
